---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralInstanceUsageFilter.StructuralUsage
source: html/97da5c43-52bd-79a2-94c2-e184c75bf221.htm
---
# Autodesk.Revit.DB.Structure.StructuralInstanceUsageFilter.StructuralUsage Property

The family instance structural usage.

## Syntax (C#)
```csharp
public StructuralInstanceUsage StructuralUsage { get; }
```